Public Attributes | List of all members
API_SkylightQuantity Struct Reference
Element Manager
Describes the different calculated values for skylight. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | openingWidth
Skylight opening width.
 double  | openingHeight
Skylight opening height.
 double  | openingSurface
Skylight opening surface.
 double  | openingVolume
Skylight opening volume.
 double  | sillHeight
Skylight sill height.
 double  | headerHeight
Skylight head height.
Detailed Description
Describes the different calculated values for skylight.
Remarks
See also the window parameters in Appendix A of the GDL Reference manual.